import unittest
from Handler.Output import Output


class TestOutput(unittest.TestCase):

    def test_win(self):
        output = Output()
        self.assertEqual(output.win(1), 'победил игрок 1')
        self.assertEqual(output.win(2), 'победил игрок 2')

    def test_draw(self):
        output = Output()
        self.assertEqual(output.draw(), 'ничья!')

    def test_error(self):
        output = Output()
        self.assertEqual(output.error(), 'ошибка ввода')

    def test_instructions(self):
        output = Output()
        self.assertEqual(output.instructions(), 'введите координаты\n(без пробелов цифра, буква)\nнажмите кнопку ВВОД')

    def test_fields(self):
        output = Output()
        field_pattern = [
            ['*', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'],
            ['1', '1', '1', '1', '1', '0', '0', '0', '0', '0', '0'],
            ['2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['3', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['4', '3', '3', '3', '3', '3', '3', '0', '0', '0', '0'],
            ['5', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['6', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['7', '0', '0', '0', '0', '0', '2', '2', '2', '2', '0'],
            ['8', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['9', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['10', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']
        ]
        field_attack = [
            ['*', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'],
            ['1', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['2', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['3', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['4', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['5', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['6', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['7', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['8', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['9', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+'],
            ['10', '?', '+', '+', '+', '+', '+', '+', '+', '+', '+']
        ]
        field_size = 10
        turn = 1
        expected_result = '''ход игрока номер 1
             игрок 1                                        игрок 2
        A  B  C  D  E  F  G  H   I   J            A  B  C  D  E  F  G  H   I   J  
   1  🚢 🚢 🚢 🚢 ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      1  ❔ + + + + + + + + + 
   2  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      2  ❔ + + + + + + + + + 
   3  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      3  ❔ + + + + + + + + + 
   4  🚢 🚢 🚢 🚢 🚢 🚢 ◼️ ◼️ ◼️ ◼️      4  ❔ + + + + + + + + + 
   5  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      5  ❔ + + + + + + + + + 
   6  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      6  ❔ + + + + + + + + + 
   7  ◼️ ◼️ ◼️ ◼️ ◼️ 🗯 🗯 🗯 🗯 ◼️      7  ❔ + + + + + + + + + 
   8  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      8  ❔ + + + + + + + + + 
   9  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️      9  ❔ + + + + + + + + + 
 10  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️    10  ❔ + + + + + + + + + 
'''
        self.assertEqual(output.fields(field_pattern, field_attack, field_size, turn), expected_result)

    def test_field(self):
        output = Output()
        field = [
            ['*', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'],
            ['1', '1', '1', '1', '1', '0', '0', '0', '0', '0', '0'],
            ['2', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['3', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['4', '3', '3', '3', '3', '3', '3', '0', '0', '0', '0'],
            ['5', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['6', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['7', '0', '0', '0', '0', '0', '2', '2', '2', '2', '0'],
            ['8', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['9', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
            ['10', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']
        ]
        n = 10
        num = 1
        expected_result = '''pасстановка 1 игрока
       A  B  C  D  E  F  G  H   I   J  
  1  🚢 🚢 🚢 🚢 ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
  2  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
  3  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
  4  🚢 🚢 🚢 🚢 🚢 🚢 ◼️ ◼️ ◼️ ◼️ 
  5  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
  6  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
  7  ◼️ ◼️ ◼️ ◼️ ◼️ 🗯 🗯 🗯 🗯 ◼️ 
  8  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
  9  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
10  ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ ◼️ 
'''
        self.assertEqual(output.field(field, n, num), expected_result)
